/*
*********************************************************************************************************
*
* 模块名称 : 蜂鸣器类库
* 文件名称 : AR_Buzzer.cpp
* 版    本 : V1.0
* 说    明 : 
*
* Copyright (C), 2015-2020, 阿波罗科技 www.apollorobot.cn
*
*********************************************************************************************************
*/

#include "AR_Buzzer.h"

/*
*********************************************************************************************************
*	函 数 名: AR_Buzzer构造函数
*	功能说明: 
*	形    参: p:控制引脚
*	返 回 值: 无
*********************************************************************************************************
*/
AR_Buzzer::AR_Buzzer(uint8_t p)
{
	pin = p;
	pinMode(pin, OUTPUT);
}
/*
*********************************************************************************************************
*	函 数 名: tone
*	功能说明: 改变蜂鸣器发声
*	形    参: note: 音调/频率 20hz~20Khz
*			  beats:节拍/周期 ms为单位
*	返 回 值: 无
*********************************************************************************************************
*/
void AR_Buzzer::tone(int note,int beats)
{
    int period = 1000000L / note;
    int pulse = period / 2;
	
	pinMode(pin, OUTPUT);
    for (long i = 0; i < beats * 1000L; i += period)
    {
      digitalWrite(pin, HIGH);
      delayMicroseconds(pulse);
      digitalWrite(pin, LOW);
      delayMicroseconds(pulse);
    }
}
/***************************** 阿波罗科技 www.apollorobot.cn (END OF FILE) *********************************/
