/*
*********************************************************************************************************
*
* 模块名称 : 光敏传感器类库
* 文件名称 : AR_LightSensor.cpp
* 版    本 : V1.0
* 说    明 : 
* 修订记录 :

* Copyright (C), 2015-2020, 阿波罗科技 www.apollorobot.cn
*
*********************************************************************************************************
*/
#include "AR_LightSensor.h"
#include "AR_PinAssign.h"
/*
*********************************************************************************************************
*	函 数 名: AR_LightSensor()构造函数
*	功能说明:  
*	形    参: p: port to light sensor
*	返 回 值: 无
*********************************************************************************************************
*/
AR_LightSensor::AR_LightSensor(uint8_t p)
{
	pin = p;
	
}
/*
*********************************************************************************************************
*	函 数 名: getLight
*	功能说明: Get light intensity
*	形    参: 无
*	返 回 值: 0~1023
*********************************************************************************************************
*/
int AR_LightSensor::getLight()
{
	switch(pin){
		case AS1_PIN:
			return analogRead(A1);
		break;
		case AS2_PIN:
			return analogRead(A0);
		break;
		case AS3_PIN:
			return analogRead(A3);
		break;
		case AS4_PIN:
			return analogRead(A2);
		break;
	}
}
/***************************** 阿波罗科技 www.apollorobot.cn (END OF FILE) *********************************/
