/*
*********************************************************************************************************
*
* 模块名称 : 敲击传感器类库
* 文件名称 : AR_KnockSensor.cpp
* 版    本 : V1.0
* 说    明 : 
* 修订记录 :
* Copyright (C), 2015-2020, 阿波罗科技 www.apollorobot.cn
*
*********************************************************************************************************
*/
#include "AR_KnockSensor.h"

/*
*********************************************************************************************************
*	函 数 名: AR_KnockSensor()构造函数
*	功能说明:  
*	形    参: p: port to IR sensor
*	返 回 值: 无
*********************************************************************************************************
*/
AR_KnockSensor::AR_KnockSensor(uint8_t p)
{
	pin = p;
	pinMode(pin, INPUT_PULLUP);
}

/*
*********************************************************************************************************
*	函 数 名: getStatu
*	功能说明: get knock sensor statu

*	形    参: 无
*	返 回 值: 0:无信号
*			  1：有信号
*********************************************************************************************************
*/
uint8_t AR_KnockSensor::getStatu()
{
	pinMode(pin, INPUT_PULLUP);
	if(digitalRead(pin) == HIGH)
		return 0;
	else
		return 1;
}
/***************************** 阿波罗科技 www.apollorobot.cn (END OF FILE) *********************************/
