#include <AR_ColorSensor.h>
#include <AR_Timer16Bit.h>


AR_ColorSensor cs;

/*
*********************************************************************************************************
*  函 数 名: T2溢出中断函数
* 功能说明: 中断周期1ms，扫描周期1S
*       因为这是个全局函数，所以类内部变量和方法是看不到的
* 形    参: 
* 返 回 值: 无
*********************************************************************************************************
*/
ISR(TIMER2_OVF_vect) 
{
       TCNT2 = 6;        
       static int tc2_count = 0;
       tc2_count ++;
       if( 1000 == tc2_count ){
           cs.scann();
           tc2_count = 0;
       }
}
/*
*********************************************************************************************************
*  函 数 名: PCINT0/2中断函数
* 功能说明: 完成out引脚计数
* 形    参: 
* 返 回 值: 无
*********************************************************************************************************
*/
ISR(PCINT0_vect)
{
    cs.g_counts ++;
} 
ISR(PCINT2_vect, ISR_ALIASOF(PCINT0_vect));

void setup() {
  // put your setup code here, to run once:
  Serial.begin(9600);
  cs.initialize(12, 13, 10);
  delay(3000);
  cs.whiteBalance();//白平衡校准过程
}

void loop() {
  // 必须要延时3S才能扫完整个RGB值
   delay(3000);
   cs.getResult();
}
